title: Suspicious PowerShell Encoded Command 

id: cyberlab-suspicious_powershell_encoded_command 

status: experimental 

description: Detects PowerShell launched with an encoded command 

author: Brent Matthew Archuleta 

date: 2026/07/14 

references: 

    - https://attack.mitre.org/techniques/T1059/001/ 

logsource: 

    category: process_creation 

    product: windows 

detection: 

    selection: 

        Image|endswith: '\\powershell.exe' 

        CommandLine|contains: '-enc' 

    condition: selection 

falsepositives: 

    - Administrative or troubleshooting activity 

level: high 

tags: 

    - attack.t1059.001 

